////////////////////////////////////////////////////////////////////////////////////////////////////////////
//// สามารถเข้ามาดูข้อมูลการใช้งานได้ที่ : https://sites.google.com/site/klsrobotcenter/lab-0-library-lotus-mega-bot
////////////////////////////////////////////////////////////////////////////////////////////////////////////

#include <LotusMegaBot.h> // ผนวกLibrary LotusMegaBot.h

void setup() {
ok(); // กดปุ่มD53 โปรแกรมถึงจะเริ่มทำงาน
}

void loop() {
oleddel(); // ลบหน้าจอ OLED
oledp(30,10,1,"Azimuth=",cp()); // แสดงค่ามุม Azimuth
oledplay(); // แสดงค่าออกหน้าจอ OLED
delay(100); // เวลา 0.1 วินาที
}
