////////////////////////////////////////////////////////////////////////////////////////////////////////////
//// สามารถเข้ามาดูข้อมูลการใช้งานได้ที่ : https://sites.google.com/site/klsrobotcenter/lab-0-library-lotus-mega-bot
////////////////////////////////////////////////////////////////////////////////////////////////////////////

#include <LotusMegaBot.h> // ผนวกLibrary LotusMegaBot.h

void setup() {
set();  // เรียกฟังก์ชันการใช้งานพื้นฐาน
}

void loop() {
oleddel(); // ฟังก์ชันลบหน้าจอ OLED
oledlnp(0,0,1,"digital 53 =",in(53)); // แสดงผลอักษรที่เริ่มต้นที่ตำแหน่งพิกเซล x=0  y=0 ขนาดตัวอักษร 1 point แสดงข้อความ digital 53 = ค่าที่วัดได้ที่พอร์ต 53 หากมีอักษรอื่นมาเพิ่มให้ขึ้นบรรทัดถัดไปln
oledplay(); // ฟังก์ชันแสดงข้อความที่หน้าจอ OLED
delay(100); // เวลา 0.1 วินาที
}
