#include <LotusMegaBot.h>
void setup()
{
  Serial.begin(9600); ///////// อ่านค่าซีเรียลมอนิเตอร์ที่บอร์ดเรท 9600
}  
/////////////////////////////////////////////////////////////////////////////////
void loop()
 {
   if(Serial.available()>0); 
{       char x = Serial.read();
        if (x == 'F') {run(100,100);}    /// รับค่าคำสั่ง F เดินหน้า
        if (x == 'B'){run(-100,-100);}   /// รับค่าคำสั่ง B ถอยหลัง
        if (x == 'R') {run(100,-100);}   /// รับค่าคำสั่ง R เลี้ยวขวา
        if (x == 'L') {run(-100,100);}   /// รับค่าคำสั่ง L เลี้ยวซ้าย
        if (x == 'S') {run(0,0);}      /// รับค่าคำสั่ง S หยุด
}}
