////////////////////////////////////////////////////////////////////////////////////////////////////////////
//// สามารถเข้ามาดูข้อมูลการใช้งานได้ที่ : https://sites.google.com/site/klsrobotcenter/lab-0-library-lotus-mega-bot
////////////////////////////////////////////////////////////////////////////////////////////////////////////
#include <LotusMegaBot.h> // ผนวกLibrary LotusMegaBot.h

void setup() {
sound(1000,100); //sound(ความถี่เสียง,ความยาวเสียงในหน่วยมิลลิวินาที);
beep();// ส่งเสียงบิ๊บ
snd(1500,2000); //sound(ความถี่เสียง,ความยาวเสียงในหน่วยมิลลิวินาที);
}

void loop() {

}
