////////////////////////////////////////////////////////////////////////////////////////////////////////////
//// สามารถเข้ามาดูข้อมูลการใช้งานได้ที่ : https://sites.google.com/site/klsrobotcenter/lab-0-library-lotus-mega-bot
////////////////////////////////////////////////////////////////////////////////////////////////////////////

#include <LotusMegaBot.h> // ผนวกLibrary LotusMegaBot.h

void setup() {
ok(); // กดปุ่มD2 โปรแกรมถึงจะเริ่มทำงาน
//////////// กลุ่มคำสั่ง run(กำลังมอเตอร์ซ้าย,กำลังมอเตอร์ขวา); สามารถกรอกได้ตั้งแต่ -255 ถึง 255
RUN(100,100); delay(1000);beep(); //มอเตอร์ทุกตัวเดินหน้าที่กำลัง 100 เป็นเวลา 1 วินาที และมีเสียงดังบิ๊บที่ลำโพงบัซเซอร์
RUN(0,0); delay(1000);beep(); //มอเตอร์ทุกตัวเดินหยุดเป็นเวลา 1 วินาที และมีเสียงดังบิ๊บที่ลำโพงบัซเซอร์

RUN(-100,-100); delay(1000);beep(); //มอเตอร์ทุกตัวถอยหลังที่กำลัง 100 เป็นเวลา 1 วินาที และมีเสียงดังบิ๊บที่ลำโพงบัซเซอร์
RUN(0,0); delay(1000);beep(); //มอเตอร์ทุกตัวเดินหยุดเป็นเวลา 1 วินาที และมีเสียงดังบิ๊บที่ลำโพงบัซเซอร์

RUN(-100,100); delay(1000);beep(); //มอเตอร์ทุกตัวเลี้ยซ้ายที่กำลัง -100,100 เป็นเวลา 1 วินาที และมีเสียงดังบิ๊บที่ลำโพงบัซเซอร์
RUN(0,0); delay(1000);beep(); //มอเตอร์ทุกตัวเดินหยุดเป็นเวลา 1 วินาที และมีเสียงดังบิ๊บที่ลำโพงบัซเซอร์

RUN(100,-100); delay(1000);beep(); //มอเตอร์ทุกตัวเลี้ยขวาที่กำลัง 100,-100 เป็นเวลา 1 วินาที และมีเสียงดังบิ๊บที่ลำโพงบัซเซอร์
RUN(0,0); delay(1000);beep(); //มอเตอร์ทุกตัวเดินหยุดเป็นเวลา 1 วินาที และมีเสียงดังบิ๊บที่ลำโพงบัซเซอร์
/*
/////////// ตัวอย่างคำสั่งเดินหน้า
run(100,100); delay(1000);beep();//ความเร็วมอเตอร์ตัวที่ 1 และ 2 ทำงานที่กำลัง 100 เป็นเวลา 1 วินาที และมีเสียงดังบิ๊บที่ลำโพงบัซเซอร์
runa(100,100); delay(1000);beep();//สั่งให้มอเตอร์คู่แรก(a)ความเร็วมอเตอร์ตัวที่ 1 และ 2 ทำงานที่กำลัง 100 เป็นเวลา 1 วินาที และมีเสียงดังบิ๊บที่ลำโพงบัซเซอร์
runb(100,100); delay(1000);beep();//สั่งให้มอเตอร์คู่ที่สอง(b)ความเร็วมอเตอร์ตัวที่ 3 และ 4 ทำงานที่กำลัง 100 เป็นเวลา 1 วินาที และมีเสียงดังบิ๊บที่ลำโพงบัซเซอร์
runc(100,100); delay(1000);beep();//สั่งให้มอเตอร์คู่ที่สาม(c)ความเร็วมอเตอร์ตัวที่ 5 และ 6 ทำงานที่กำลัง 100 เป็นเวลา 1 วินาที และมีเสียงดังบิ๊บที่ลำโพงบัซเซอร์
/////////// ตัวอย่างคำสั่งถอยหลัง
run(-100,-100); delay(1000);beep();//ความเร็วมอเตอร์ตัวที่ 1 และ 2 ทำงานที่กำลัง -100 เป็นเวลา 1 วินาที และมีเสียงดังบิ๊บที่ลำโพงบัซเซอร์
runa(-100,-100); delay(1000);beep();//สั่งให้มอเตอร์คู่แรก(a)ความเร็วมอเตอร์ตัวที่ 1 และ 2 ทำงานที่กำลัง -100 เป็นเวลา 1 วินาที และมีเสียงดังบิ๊บที่ลำโพงบัซเซอร์
runb(-100,-100); delay(1000);beep();//สั่งให้มอเตอร์คู่ที่สอง(b)ความเร็วมอเตอร์ตัวที่ 3 และ 4 ทำงานที่กำลัง -100 เป็นเวลา 1 วินาที และมีเสียงดังบิ๊บที่ลำโพงบัซเซอร์
runc(-100,-100); delay(1000);beep();//สั่งให้มอเตอร์คู่ที่สาม(c)ความเร็วมอเตอร์ตัวที่ 5 และ 6 ทำงานที่กำลัง -100 เป็นเวลา 1 วินาที และมีเสียงดังบิ๊บที่ลำโพงบัซเซอร์

/////////// ตัวอย่างคำสั่งเลี้ยวซ้าย
run(-100,100); delay(1000);beep();//ความเร็วมอเตอร์ตัวที่ 1 และ 2 ทำงานที่กำลัง -100,100 เป็นเวลา 1 วินาที และมีเสียงดังบิ๊บที่ลำโพงบัซเซอร์
runa(-100,100); delay(1000);beep();//สั่งให้มอเตอร์คู่แรก(a)ความเร็วมอเตอร์ตัวที่ 1 และ 2 ทำงานที่กำลัง -100,100 เป็นเวลา 1 วินาที และมีเสียงดังบิ๊บที่ลำโพงบัซเซอร์
runb(-100,100); delay(1000);beep();//สั่งให้มอเตอร์คู่ที่สอง(b)ความเร็วมอเตอร์ตัวที่ 3 และ 4 ทำงานที่กำลัง -100,100 เป็นเวลา 1 วินาที และมีเสียงดังบิ๊บที่ลำโพงบัซเซอร์
runc(-100,100); delay(1000);beep();//สั่งให้มอเตอร์คู่ที่สาม(c)ความเร็วมอเตอร์ตัวที่ 5 และ 6 ทำงานที่กำลัง -100,100 เป็นเวลา 1 วินาที และมีเสียงดังบิ๊บที่ลำโพงบัซเซอร์

/////////// ตัวอย่างคำสั่งเลี้ยวขวา
run(100,-100); delay(1000);beep();//ความเร็วมอเตอร์ตัวที่ 1 และ 2 ทำงานที่กำลัง 100,-100 เป็นเวลา 1 วินาที และมีเสียงดังบิ๊บที่ลำโพงบัซเซอร์
runa(100,-100); delay(1000);beep();//สั่งให้มอเตอร์คู่แรก(a)ความเร็วมอเตอร์ตัวที่ 1 และ 2 ทำงานที่กำลัง 100,-100 เป็นเวลา 1 วินาที และมีเสียงดังบิ๊บที่ลำโพงบัซเซอร์
runb(100,-100); delay(1000);beep();//สั่งให้มอเตอร์คู่ที่สอง(b)ความเร็วมอเตอร์ตัวที่ 3 และ 4 ทำงานที่กำลัง 100,-100 เป็นเวลา 1 วินาที และมีเสียงดังบิ๊บที่ลำโพงบัซเซอร์
runc(100,-100); delay(1000);beep();//สั่งให้มอเตอร์คู่ที่สาม(c)ความเร็วมอเตอร์ตัวที่ 5 และ 6 ทำงานที่กำลัง 100,-100 เป็นเวลา 1 วินาที และมีเสียงดังบิ๊บที่ลำโพงบัซเซอร์

/////////// ตัวอย่างคำสั่งหยุด
RUN(0,0); // มอเตอร์ทุกตัวทำการหยุดการทำงาน
*/
}
void loop() {

}
