////////////////////////////////////////////////////////////////////////////////////////////////////////////
//// สามารถเข้ามาดูข้อมูลการใช้งานได้ที่ : https://sites.google.com/site/klsrobotcenter/lab-0-library-lotus-mega-bot
////////////////////////////////////////////////////////////////////////////////////////////////////////////

#include <LotusMegaBot.h> // ผนวกLibrary LotusMegaBot.h

void setup() {
ok(); // กดปุ่มD53 โปรแกรมถึงจะเริ่มทำงาน
}

void loop() {
servo(1,60); // เซอร์โว 1 ทำงานที่ 30 องศา
delay(1000); // เวลา 1 วินาที
servo(1,90); // เซอร์โว 1 ทำงานที่ 60 องศา
delay(1000); // เวลา 1 วินาที
}
