////////////////////////////////////////////////////////////////////////////////////////////////////////////
//// สามารถเข้ามาดูข้อมูลการใช้งานได้ที่ : https://sites.google.com/site/klsrobotcenter/lab-0-library-lotus-mega-bot
////////////////////////////////////////////////////////////////////////////////////////////////////////////

#include <LotusMegaBot.h> // ผนวกLibrary LotusMegaBot.h

void setup() {
set();  // เรียกฟังก์ชันการใช้งานพื้นฐาน
///////////////  ตัวอย่างการเขียนรูปแบบที่ 1 
beep(); // ส่งเสียงบิ๊บ
oleddel(); // ฟังก์ชันลบหน้าจอ OLED
oledp(10,0,1,"Lotus Mega Bot"); // แสดงผลอักษรที่เริ่มต้นที่ตำแหน่งพิกเซล x=10  y=0 ขนาดตัวอักษร 1 point แสดงข้อความ Lotus Mega Bot
oledplay(); // ฟังก์ชันแสดงข้อความที่หน้าจอ OLED
delay(2000); // เวลา 2 วินาที
beep(); // ส่งเสียงบิ๊บ

///////////////  ตัวอย่างการเขียนรูปแบบที่ 2 
oleddel(); // ฟังก์ชันลบหน้าจอ OLED
oledcur(10,10); // แสดงผลอักษรที่เริ่มต้นที่ตำแหน่งพิกเซล x=10  y=10 
oledsize(2); //ขนาดตัวอักษร 2 point
oledlnp("Lotus");//แสดงข้อความ Mega Bot
oledp("Mega Bot");//แสดงข้อความ Mega Bot
oledplay(); // ฟังก์ชันแสดงข้อความที่หน้าจอ OLED
delay(2000); // เวลา 2 วินาที
beep(); // ส่งเสียงบิ๊บ

}

void loop() {



}
